In [1]:
%load_ext sql

In [2]:
%sql postgresql://retail_user:retail_password@localhost:5432/retail_db

In [3]:
%sql SELECT current_database()

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('retail_db',)]

In [4]:
%%sql
SELECT 
    lower('hEllo wOrlD') as lower_result,
    upper('hEllo wOrlD') as upper_result,
    initcap('hEllo wOrlD') as capitize_result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('hello world', 'HELLO WORLD', 'Hello World')]

In [5]:
%%sql
SELECT length('hEllo wOrlD') as length

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(11,)]

In [7]:
%%sql
SELECT substring('123 456 7890' FROM length('123 456 7890') - 4) AS result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(' 7890',)]

In [9]:
%%sql
SELECT split_part('2013-07-25', '-', 2) AS result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('07',)]

In [10]:
%%sql 

SELECT position('@' IN 'it@versity.com'),
    position('@' IN 'itversity.com')

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(3, 0)]

In [17]:
%%sql

SELECT length(ltrim('     Hello World.   ')) AS result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(15,)]

In [12]:
%%sql

SELECT rtrim('     Hello World       ') AS result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('     Hello World',)]

In [18]:
%%sql
SELECT trim('.      HEllo World.         ') as result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('.      HEllo World.',)]

In [19]:
%%sql
SELECT LPAD('123', 5, '0') as result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('00123',)]

In [20]:
%%sql
SELECT RPAD('123', 5, '0') as result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('12300',)]

In [21]:
%%sql
SELECT REPLACE('Hello World', 'World', 'SQL') as result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('Hello SQL',)]

In [23]:

%%sql

SELECT translate('+86 (238) 954-9649', '+()-', '0') AS result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('086 238 9549649',)]

### Date Functions

In [24]:
%%sql

SELECT current_date AS current_date

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.date(2024, 10, 25),)]

In [25]:
%%sql

SELECT current_timestamp AS current_timestamp

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.datetime(2024, 10, 25, 14, 42, 24, 822498, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))),)]

In [26]:
%%sql

SELECT substring(current_date::varchar, 1, 4) AS current_date

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('2024',)]

In [29]:
%%sql

SELECT current_date + INTERVAL '2 DAYS' AS result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.datetime(2024, 10, 27, 0, 0),)]

In [30]:
%%sql

SELECT '2019-01-31'::date + INTERVAL '3 MONTHS' AS result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.datetime(2019, 4, 30, 0, 0),)]

In [31]:
%%sql

SELECT current_timestamp + INTERVAL '3 YEARS' AS result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.datetime(2027, 10, 25, 14, 46, 32, 161313, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))),)]

In [32]:
%%sql

SELECT current_timestamp + INTERVAL '10 HOURS' AS result

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.datetime(2024, 10, 26, 0, 46, 42, 833653, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))),)]

In [34]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char(current_timestamp, 'yy') AS year

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.datetime(2024, 10, 25, 14, 54, 52, 581222, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))), '24')]

In [35]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char(current_timestamp, 'day') AS day_name

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.datetime(2024, 10, 25, 14, 55, 34, 91647, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))), 'friday   ')]

In [36]:
%%sql

SELECT current_timestamp AS current_timestamp, 
    to_char(current_timestamp, 'HH') AS hour24

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.datetime(2024, 10, 25, 14, 55, 51, 888381, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))), '02')]

In [37]:
%%sql

SELECT to_char(current_timestamp, 'yyyy/MM/dd') AS current_date

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('2024/10/25',)]

#### Dealing with Unix TimestampÂ¶
Let us go through the functions that can be used to deal with Unix Timestamp.

extract with epoch can be used to convert Unix epoch to regular timestamp. We can also use date_part;

to_timestamp can be used to convert timestamp to Unix epoch.

We can get Unix epoch or Unix timestamp by running date '+%s' in Unix/Linux terminal

Let us sww how we can use functions such as extract or to_timestamp to convert between timestamp and Unix timestamp or epoch.

We can unix epoch in Unix/Linux terminal using date '+%s'

In [38]:
%%sql

SELECT extract(epoch FROM current_date) AS date_epoch

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(Decimal('1729814400'),)]

In [39]:
%%sql

SELECT date_part('epoch', current_date) AS date_epoch

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(1729814400.0,)]

In [40]:
%%sql

SELECT extract(epoch FROM '2019-04-30 18:18:51'::timestamp) AS unixtime

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(Decimal('1556648331.000000'),)]

In [41]:
%%sql

SELECT to_timestamp(1556662731) AS time_from_epoch

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(datetime.datetime(2019, 5, 1, 3, 48, 51, tzinfo=datetime.timezone(datetime.timedelta(seconds=19800))),)]

In [45]:
%%sql

SELECT to_char(to_timestamp(1556662731), 'yyyyMMdd')::int AS yyyyMM_from_epoch

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(20190501,)]

In [46]:
%%sql

SELECT DISTINCT order_status,
    CASE 
        WHEN order_status IN ('COMPLETE', 'CLOSED') THEN 'COMPLETED'
        WHEN order_status LIKE '%PENDING%' OR order_status IN ('PROCESSING', 'PAYMENT_REVIEW')
            THEN 'PENDING'
        ELSE 'OTHER'
    END AS updated_order_status
FROM orders
ORDER BY updated_order_status
LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
9 rows affected.

[('CLOSED', 'COMPLETED'),
 ('COMPLETE', 'COMPLETED'),
 ('SUSPECTED_FRAUD', 'OTHER'),
 ('CANCELED', 'OTHER'),
 ('ON_HOLD', 'OTHER'),
 ('PAYMENT_REVIEW', 'PENDING'),
 ('PENDING_PAYMENT', 'PENDING'),
 ('PENDING', 'PENDING'),
 ('PROCESSING', 'PENDING')]

In [47]:
%%sql

CREATE TABLE users(
    user_id SERIAL PRIMARY KEY,
    user_first_name VARCHAR(30),
    user_last_name VARCHAR(30),
    user_email_id VARCHAR(50),
    user_gender VARCHAR(1),
    user_unique_id VARCHAR(15),
    user_phone_no VARCHAR(20),
    user_dob DATE,
    created_ts TIMESTAMP
)

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [48]:
%%sql

insert into users (
    user_first_name, user_last_name, user_email_id, user_gender, 
    user_unique_id, user_phone_no, user_dob, created_ts
) VALUES
    ('Giuseppe', 'Bode', 'gbode0@imgur.com', 'M', '88833-8759', 
     '+86 (764) 443-1967', '1973-05-31', '2018-04-15 12:13:38'),
    ('Lexy', 'Gisbey', 'lgisbey1@mail.ru', 'F', '262501-029', 
     '+86 (751) 160-3742', '2003-05-31', '2020-12-29 06:44:09'),
    ('Karel', 'Claringbold', 'kclaringbold2@yale.edu', 'F', '391-33-2823', 
     '+62 (445) 471-2682', '1985-11-28', '2018-11-19 00:04:08'),
    ('Marv', 'Tanswill', 'mtanswill3@dedecms.com', 'F', '1195413-80', 
     '+62 (497) 736-6802', '1998-05-24', '2018-11-19 16:29:43'),
    ('Gertie', 'Espinoza', 'gespinoza4@nationalgeographic.com', 'M', '471-24-6869', 
     '+249 (687) 506-2960', '1997-10-30', '2020-01-25 21:31:10'),
    ('Saleem', 'Danneil', 'sdanneil5@guardian.co.uk', 'F', '192374-933', 
     '+63 (810) 321-0331', '1992-03-08', '2020-11-07 19:01:14'),
    ('Rickert', 'O''Shiels', 'roshiels6@wikispaces.com', 'M', '749-27-47-52', 
     '+86 (184) 759-3933', '1972-11-01', '2018-03-20 10:53:24'),
    ('Cybil', 'Lissimore', 'clissimore7@pinterest.com', 'M', '461-75-4198', 
     '+54 (613) 939-6976', '1978-03-03', '2019-12-09 14:08:30'),
    ('Melita', 'Rimington', 'mrimington8@mozilla.org', 'F', '892-36-676-2', 
     '+48 (322) 829-8638', '1995-12-15', '2018-04-03 04:21:33'),
    ('Benetta', 'Nana', 'bnana9@google.com', 'M', '197-54-1646', 
     '+420 (934) 611-0020', '1971-12-07', '2018-10-17 21:02:51'),
    ('Gregorius', 'Gullane', 'ggullanea@prnewswire.com', 'F', '232-55-52-58', 
     '+62 (780) 859-1578', '1973-09-18', '2020-01-14 23:38:53'),
    ('Una', 'Glayzer', 'uglayzerb@pinterest.com', 'M', '898-84-336-6', 
     '+380 (840) 437-3981', '1983-05-26', '2019-09-17 03:24:21'),
    ('Jamie', 'Vosper', 'jvosperc@umich.edu', 'M', '247-95-68-44', 
     '+81 (205) 723-1942', '1972-03-18', '2020-07-23 16:39:33'),
    ('Calley', 'Tilson', 'ctilsond@issuu.com', 'F', '415-48-894-3', 
     '+229 (698) 777-4904', '1987-06-12', '2020-06-05 12:10:50'),
    ('Peadar', 'Gregorowicz', 'pgregorowicze@omniture.com', 'M', '403-39-5-869', 
     '+7 (267) 853-3262', '1996-09-21', '2018-05-29 23:51:31'),
    ('Jeanie', 'Webling', 'jweblingf@booking.com', 'F', '399-83-05-03', 
     '+351 (684) 413-0550', '1994-12-27', '2018-02-09 01:31:11'),
    ('Yankee', 'Jelf', 'yjelfg@wufoo.com', 'F', '607-99-0411', 
     '+1 (864) 112-7432', '1988-11-13', '2019-09-16 16:09:12'),
    ('Blair', 'Aumerle', 'baumerleh@toplist.cz', 'F', '430-01-578-5', 
     '+7 (393) 232-1860', '1979-11-09', '2018-10-28 19:25:35'),
    ('Pavlov', 'Steljes', 'psteljesi@macromedia.com', 'F', '571-09-6181', 
     '+598 (877) 881-3236', '1991-06-24', '2020-09-18 05:34:31'),
    ('Darn', 'Hadeke', 'dhadekej@last.fm', 'M', '478-32-02-87', 
     '+370 (347) 110-4270', '1984-09-04', '2018-02-10 12:56:00'),
    ('Wendell', 'Spanton', 'wspantonk@de.vu', 'F', null, 
     '+84 (301) 762-1316', '1973-07-24', '2018-01-30 01:20:11'),
    ('Carlo', 'Yearby', 'cyearbyl@comcast.net', 'F', null, 
     '+55 (288) 623-4067', '1974-11-11', '2018-06-24 03:18:40'),
    ('Sheila', 'Evitts', 'sevittsm@webmd.com', null, '830-40-5287',
     null, '1977-03-01', '2020-07-20 09:59:41'),
    ('Sianna', 'Lowdham', 'slowdhamn@stanford.edu', null, '778-0845', 
     null, '1985-12-23', '2018-06-29 02:42:49'),
    ('Phylys', 'Aslie', 'paslieo@qq.com', 'M', '368-44-4478', 
     '+86 (765) 152-8654', '1984-03-22', '2019-10-01 01:34:28')

 * postgresql://retail_user:***@localhost:5432/retail_db
25 rows affected.

[]

In [49]:
%%sql
SELECT * FROM users

 * postgresql://retail_user:***@localhost:5432/retail_db
25 rows affected.

[(1, 'Giuseppe', 'Bode', 'gbode0@imgur.com', 'M', '88833-8759', '+86 (764) 443-1967', datetime.date(1973, 5, 31), datetime.datetime(2018, 4, 15, 12, 13, 38)),
 (2, 'Lexy', 'Gisbey', 'lgisbey1@mail.ru', 'F', '262501-029', '+86 (751) 160-3742', datetime.date(2003, 5, 31), datetime.datetime(2020, 12, 29, 6, 44, 9)),
 (3, 'Karel', 'Claringbold', 'kclaringbold2@yale.edu', 'F', '391-33-2823', '+62 (445) 471-2682', datetime.date(1985, 11, 28), datetime.datetime(2018, 11, 19, 0, 4, 8)),
 (4, 'Marv', 'Tanswill', 'mtanswill3@dedecms.com', 'F', '1195413-80', '+62 (497) 736-6802', datetime.date(1998, 5, 24), datetime.datetime(2018, 11, 19, 16, 29, 43)),
 (5, 'Gertie', 'Espinoza', 'gespinoza4@nationalgeographic.com', 'M', '471-24-6869', '+249 (687) 506-2960', datetime.date(1997, 10, 30), datetime.datetime(2020, 1, 25, 21, 31, 10)),
 (6, 'Saleem', 'Danneil', 'sdanneil5@guardian.co.uk', 'F', '192374-933', '+63 (810) 321-0331', datetime.date(1992, 3, 8), datetime.datetime(2020, 11, 7, 19, 1, 14)),
 (7, 'Rickert', "O'Shiels", 'roshiels6@wikispaces.com', 'M', '749-27-47-52', '+86 (184) 759-3933', datetime.date(1972, 11, 1), datetime.datetime(2018, 3, 20, 10, 53, 24)),
 (8, 'Cybil', 'Lissimore', 'clissimore7@pinterest.com', 'M', '461-75-4198', '+54 (613) 939-6976', datetime.date(1978, 3, 3), datetime.datetime(2019, 12, 9, 14, 8, 30)),
 (9, 'Melita', 'Rimington', 'mrimington8@mozilla.org', 'F', '892-36-676-2', '+48 (322) 829-8638', datetime.date(1995, 12, 15), datetime.datetime(2018, 4, 3, 4, 21, 33)),
 (10, 'Benetta', 'Nana', 'bnana9@google.com', 'M', '197-54-1646', '+420 (934) 611-0020', datetime.date(1971, 12, 7), datetime.datetime(2018, 10, 17, 21, 2, 51)),
 (11, 'Gregorius', 'Gullane', 'ggullanea@prnewswire.com', 'F', '232-55-52-58', '+62 (780) 859-1578', datetime.date(1973, 9, 18), datetime.datetime(2020, 1, 14, 23, 38, 53)),
 (12, 'Una', 'Glayzer', 'uglayzerb@pinterest.com', 'M', '898-84-336-6', '+380 (840) 437-3981', datetime.date(1983, 5, 26), datetime.datetime(2019, 9, 17, 3, 24, 21)),
 (13, 'Jamie', 'Vosper', 'jvosperc@umich.edu', 'M', '247-95-68-44', '+81 (205) 723-1942', datetime.date(1972, 3, 18), datetime.datetime(2020, 7, 23, 16, 39, 33)),
 (14, 'Calley', 'Tilson', 'ctilsond@issuu.com', 'F', '415-48-894-3', '+229 (698) 777-4904', datetime.date(1987, 6, 12), datetime.datetime(2020, 6, 5, 12, 10, 50)),
 (15, 'Peadar', 'Gregorowicz', 'pgregorowicze@omniture.com', 'M', '403-39-5-869', '+7 (267) 853-3262', datetime.date(1996, 9, 21), datetime.datetime(2018, 5, 29, 23, 51, 31)),
 (16, 'Jeanie', 'Webling', 'jweblingf@booking.com', 'F', '399-83-05-03', '+351 (684) 413-0550', datetime.date(1994, 12, 27), datetime.datetime(2018, 2, 9, 1, 31, 11)),
 (17, 'Yankee', 'Jelf', 'yjelfg@wufoo.com', 'F', '607-99-0411', '+1 (864) 112-7432', datetime.date(1988, 11, 13), datetime.datetime(2019, 9, 16, 16, 9, 12)),
 (18, 'Blair', 'Aumerle', 'baumerleh@toplist.cz', 'F', '430-01-578-5', '+7 (393) 232-1860', datetime.date(1979, 11, 9), datetime.datetime(2018, 10, 28, 19, 25, 35)),
 (19, 'Pavlov', 'Steljes', 'psteljesi@macromedia.com', 'F', '571-09-6181', '+598 (877) 881-3236', datetime.date(1991, 6, 24), datetime.datetime(2020, 9, 18, 5, 34, 31)),
 (20, 'Darn', 'Hadeke', 'dhadekej@last.fm', 'M', '478-32-02-87', '+370 (347) 110-4270', datetime.date(1984, 9, 4), datetime.datetime(2018, 2, 10, 12, 56)),
 (21, 'Wendell', 'Spanton', 'wspantonk@de.vu', 'F', None, '+84 (301) 762-1316', datetime.date(1973, 7, 24), datetime.datetime(2018, 1, 30, 1, 20, 11)),
 (22, 'Carlo', 'Yearby', 'cyearbyl@comcast.net', 'F', None, '+55 (288) 623-4067', datetime.date(1974, 11, 11), datetime.datetime(2018, 6, 24, 3, 18, 40)),
 (23, 'Sheila', 'Evitts', 'sevittsm@webmd.com', None, '830-40-5287', None, datetime.date(1977, 3, 1), datetime.datetime(2020, 7, 20, 9, 59, 41)),
 (24, 'Sianna', 'Lowdham', 'slowdhamn@stanford.edu', None, '778-0845', None, datetime.date(1985, 12, 23), datetime.datetime(2018, 6, 29, 2, 42, 49)),
 (25, 'Phylys', 'Aslie', 'paslieo@qq.com', 'M', '368-44-4478', '+86 (765) 152-8654', datetime.date(1984, 3, 22), datetime.datetime(2019, 10, 1, 1, 34, 28))]

In [50]:
%%sql
SELECT 
    EXTRACT('YEAR' FROM  created_ts) as created_year, 
    COUNT(user_id) as user_count 
FROM 
    users
GROUP BY 
    EXTRACT('YEAR' FROM  created_ts)
ORDER BY
    created_year

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[(Decimal('2018'), 13), (Decimal('2019'), 4), (Decimal('2020'), 8)]

### Get the day name of the birth days for all the users born in the month of June.

Use users table for this exercise.

Output should contain user_id, user_dob, user_email_id and user_day_of_birth.

Use date specific functions to get the month using user_dob.

user_day_of_birth should be full day with first character in upper case such as Tuesday

Data should be sorted by day with in the month of May.

In [65]:
%%sql
SELECT 
    user_id,
    user_dob,
    user_email_id,
    TO_CHAR(user_dob, 'Day') AS user_day_of_birth
FROM 
    users
WHERE 
    EXTRACT(MONTH FROM user_dob) = 6
ORDER BY 
    EXTRACT(DAY FROM user_dob);

 * postgresql://retail_user:***@localhost:5432/retail_db
2 rows affected.

[(14, datetime.date(1987, 6, 12), 'ctilsond@issuu.com', 'Friday   '),
 (19, datetime.date(1991, 6, 24), 'psteljesi@macromedia.com', 'Monday   ')]

### Exercise 4Â¶
Get the number of users by gender.

Use users table for this exercise.

Output should contain gender and user_count.

For males the output should display Male and for females the output should display Female.

If gender is not specified, then it should display Not Specified.

Data should be sorted in descending order by user_count.

In [73]:
%%sql
SELECT 
    CASE 
        WHEN user_gender = 'M' THEN 'M'
        WHEN user_gender = 'F' THEN 'F'
        ELSE 'Not Specified'
    END AS user_gender,
    COUNT(*) AS user_count
FROM 
    users
GROUP BY 
    CASE 
        WHEN user_gender = 'M' THEN 'M'
        WHEN user_gender = 'F' THEN 'F'
        ELSE 'Not Specified'
    END
ORDER BY
    user_count DESC

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[('F', 13), ('M', 10), ('Not Specified', 2)]

### Exercise 5Â¶
Get last 4 digits of unique ids.

Use users table for this exercise.

Output should contain user_id, user_unique_id and user_unique_id_last4

Unique ids are either null or not null.

Unique ids contain numbers and hyphens and are of different length.

We need to get last 4 digits discarding hyphens only when the number of digits are at least 9.

If unique id is null, then you should dispaly Not Specified.

After discarding hyphens, if unique id have less than 9 digits then you should display Invalid Unique Id.

Data should be sorted by user_id. You might see None or null for those user ids where there is no unique id for user_unique_id

In [79]:
%%sql
SELECT 
    user_id,
    user_unique_id,
    CASE
        WHEN user_unique_id IS NULL THEN 'Not Sepecified'
        ELSE
            CASE
                WHEN LENGTH(REGEXP_REPLACE(user_unique_id, '-','', 'g')) >= 9 
                THEN RIGHT(REGEXP_REPLACE(user_unique_id, '-','', 'g'),4)
                ELSE 'Invalid Unique Id'
            END
    END AS user_unique_id_last4
FROM 
    users
ORDER BY
    user_id

 * postgresql://retail_user:***@localhost:5432/retail_db
25 rows affected.

[(1, '88833-8759', '8759'),
 (2, '262501-029', '1029'),
 (3, '391-33-2823', '2823'),
 (4, '1195413-80', '1380'),
 (5, '471-24-6869', '6869'),
 (6, '192374-933', '4933'),
 (7, '749-27-47-52', '4752'),
 (8, '461-75-4198', '4198'),
 (9, '892-36-676-2', '6762'),
 (10, '197-54-1646', '1646'),
 (11, '232-55-52-58', '5258'),
 (12, '898-84-336-6', '3366'),
 (13, '247-95-68-44', '6844'),
 (14, '415-48-894-3', '8943'),
 (15, '403-39-5-869', '5869'),
 (16, '399-83-05-03', '0503'),
 (17, '607-99-0411', '0411'),
 (18, '430-01-578-5', '5785'),
 (19, '571-09-6181', '6181'),
 (20, '478-32-02-87', '0287'),
 (21, None, 'Not Sepecified'),
 (22, None, 'Not Sepecified'),
 (23, '830-40-5287', '5287'),
 (24, '778-0845', 'Invalid Unique Id'),
 (25, '368-44-4478', '4478')]

### Exercise 6Â¶
Get the count of users based up on country code.

Use users table for this exercise.

Output should contain country code and count.

There should be no + in the country code. It should only contain digits.

Data should be sorted as numbers by country code.

We should discard user_phone_no with null values.

Here is the desired output:

In [88]:
%%sql

SELECT 
    replace(split_part(user_phone_no, ' ', 1),'+','') AS country_code,
    count(*)
FROM 
    users
WHERE 
    replace(split_part(user_phone_no, ' ', 1),'+','') IS NOT NULL
GROUP BY
    replace(split_part(user_phone_no, ' ', 1),'+','')
ORDER BY
    country_code

 * postgresql://retail_user:***@localhost:5432/retail_db
17 rows affected.

[('1', 1),
 ('229', 1),
 ('249', 1),
 ('351', 1),
 ('370', 1),
 ('380', 1),
 ('420', 1),
 ('48', 1),
 ('54', 1),
 ('55', 1),
 ('598', 1),
 ('62', 3),
 ('63', 1),
 ('7', 2),
 ('81', 1),
 ('84', 1),
 ('86', 4)]

### Get the count of users based up on country code.

Use users table for this exercise.

Output should contain country code and count.

There should be no + in the country code. It should only contain digits.

Data should be sorted as numbers by country code.

We should discard user_phone_no with null values.

Here is the desired output:

In [89]:
%%sql

SELECT 
    CAST(replace(split_part(user_phone_no, ' ', 1), '+', '') AS INTEGER) AS country_code,
    COUNT(*) AS count
FROM 
    users
WHERE 
    user_phone_no IS NOT NULL 
    AND replace(split_part(user_phone_no, ' ', 1), '+', '') ~ '^[0-9]+$'
GROUP BY 
    country_code
ORDER BY 
    country_code;

 * postgresql://retail_user:***@localhost:5432/retail_db
17 rows affected.

[(1, 1),
 (7, 2),
 (48, 1),
 (54, 1),
 (55, 1),
 (62, 3),
 (63, 1),
 (81, 1),
 (84, 1),
 (86, 4),
 (229, 1),
 (249, 1),
 (351, 1),
 (370, 1),
 (380, 1),
 (420, 1),
 (598, 1)]

### Let us validate if we have invalid order_item_subtotal as part of order_items table.

order_items table have 6 fields.

order_item_id

order_item_order_id

order_item_product_id

order_item_quantity

order_item_subtotal

order_item_product_price

order_item_subtotal is nothing but product of order_item_quantity and order_item_product_price. It means order_item_subtotal is compute by multiplying order_item_quantity and order_item_product_price for each item.

You need to get the count of order_items where order_item_subtotal is not equal to the product of order_item_quantity and order_item_product_price.

There can be issues related to rounding off. Make sure it is taken care using appropriate function.

Output should be 0 as there are no such records.

In [94]:
%%sql
SELECT 
    COUNT(*)
FROM
    order_items
WHERE 
    ROUND(CAST(order_item_quantity * order_item_product_price AS NUMERIC), 2) != ROUND(CAST(order_item_subtotal AS NUMERIC), 2);

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(0,)]

### Get number of orders placed on weekdays and weekends in the month of January 2014.

orders have 4 fields

order_id

order_date

order_customer_id

order_status

Use order date to determine the day on which orders are placed.

Output should contain 2 columns - day_type and order_count.

day_type should have 2 values Week days and Weekend days.

Here is the desired output.

In [95]:
%%sql
SELECT * FROM orders LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'PENDING_PAYMENT'),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'PENDING_PAYMENT')]

In [101]:
%%sql
SELECT TO_CHAR(order_date, 'DAY') as day FROM orders LIMIT 10

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[('THURSDAY ',),
 ('THURSDAY ',),
 ('THURSDAY ',),
 ('THURSDAY ',),
 ('THURSDAY ',),
 ('THURSDAY ',),
 ('THURSDAY ',),
 ('THURSDAY ',),
 ('THURSDAY ',),
 ('THURSDAY ',)]

In [103]:
%%sql
WITH CTE AS
(
 SELECT 
    CASE
        WHEN to_char(order_date, 'DAY') IN ('SATURDAY', 'SUNDAY') THEN 'Weekend Days'
        WHEN to_char(order_date, 'DAY') NOT IN ('SATURDAY', 'SUNDAY') THEN 'Week Days'
    END AS day_type
)
SELECT * FROM CTE

 * postgresql://retail_user:***@localhost:5432/retail_db
(psycopg2.errors.UndefinedColumn) column "order_date" does not exist
LINE 5:         WHEN to_char(order_date, 'DAY') IN ('SATURDAY', 'SUN...
                             ^

[SQL: WITH CTE AS
(
 SELECT
    CASE
        WHEN to_char(order_date, 'DAY') IN ('SATURDAY', 'SUNDAY') THEN 'Weekend Days'
        WHEN to_char(order_date, 'DAY') NOT IN ('SATURDAY', 'SUNDAY') THEN 'Week Days'
    END AS day_type
)
SELECT * FROM CTE]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [109]:
%%sql
WITH CTE AS (
    SELECT 
        CASE
            WHEN to_char(order_date, 'DAY') IN ('SATURDAY', 'SUNDAY') THEN 'Weekend Days'
            WHEN to_char(order_date, 'DAY') NOT IN ('SATURDAY', 'SUNDAY') THEN 'Week Days'
        END AS day_type,
        order_date
    FROM orders
)
SELECT day_type, COUNT(*) FROM CTE  WHERE EXTRACT(YEAR FROM order_date) = 2014
AND EXTRACT(MONTH FROM order_date) = 1  GROUP BY day_type ;

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('Week Days', 5908)]

In [110]:
%%sql
SELECT 
    CASE
        WHEN TO_CHAR(order_date, 'DAY') IN ('SATURDAY', 'SUNDAY') THEN 'Weekend Days'
        ELSE 'Week Days'
    END AS day_type,
    COUNT(order_id) AS order_count
FROM 
    orders
WHERE 
    EXTRACT(YEAR FROM order_date) = 2014
    AND EXTRACT(MONTH FROM order_date) = 1
GROUP BY 
    day_type;

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('Week Days', 5908)]